Revit 2024 API
TopographySurface.ArePointsEditable Property
 Identifies whether the points of this topography surface can be edited independently. Topography surfaces created from external data will not allow editing of individual points.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool ArePointsEditable { get; }
Visual Basic
Public ReadOnly Property ArePointsEditable As Boolean
	Get
Visual C++
public:
property bool ArePointsEditable {
	bool get ();
}
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace